app/controllers/api/v1/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
  def show
    jwt_token = request.headers[:Authorization]
    decode_token = JWT.decode(jwt_token, 'app_secret', true, { algorithm: 'HS256' })

    id = decode_token.first['id']
    user = User.find(id)