app/controllers/api/v1/boardgames_controller.rb

SELECT "boardgames".* FROM "boardgames"
---
    def index
        boardgames = Boardgame.all