app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "henry"], ["updated_at", "2019-08-22 18:29:34.255880"], ["id", 28]]
---
    def update
        user = User.find_by(id: params[:id])
        user.update(username: params[:username])

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "bob"], ["password_digest", "$2a$12$MrDHcL0bbL7OFiJOrZlNq.pheZ/JDz.UEMoBQzmLf1Ufn.q.cdTO2"], ["created_at", "2019-08-22 18:22:44.403881"], ["updated_at", "2019-08-22 18:22:44.403881"]]
---
    def create
        user = User.create(username: params[:username], password: params[:password])